NACA0012_pimple/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            (turbulenceModelSchemes);

libs            ( "libforces.so" "libfieldFunctionObjects.so" "libsampling.so" "turbulenceModelSchemes.so");

application     pimpleFoam;


startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.01;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


adjustTimeStep  yes;

maxCo           0.5;

functions
{
forces_cylinder
    {
        type        forces;
        functionObjectLibs ("libforces.so");
        patches     (cylinder);
        rho         rhoInf;
        rhoInf      1;
        CofR        (0 0 0);
        log         yes;
        outputControl runTime;
        outputInterval 0.1;
    }

     patchPressure_cylinder
    {
       type            forces;
       libs            ("libforces.so");
       patches         (cylinder);

       p               p;
       U               U;
     rho rhoInf;
     rhoInf 1;
     CofR (0 0 0 );
writeControl runTime;
writeInterval 1.0;

   }
}

// ************************************************************************* //
